<template>
  <div>
    <section class="section info-section">
      <h1 class="title">Доставка обедов в Алматы</h1>
      <h1 class="subtitle">🍽 Голодны в офисе? Не беспокойтесь! У нас есть решение! 🏢</h1>
      <div style="display:flex;align-items: center;">
        <span>Свяжитесь с нами:</span>
        <div>
          <a class="custom-icon icon has-text-info" href="tel:+77085293662">
            <fa-icon :icon="['fas', 'phone']"></fa-icon>
          </a>
          <a style="color: lightgreen;" class="custom-icon icon has-text-info" href="https://wa.me/77085293662?text=Здравствуйте,%20интересует%20доставка%20обедов%20в%20офис!">
            <fa-icon :icon="['fab', 'whatsapp']"></fa-icon>
          </a>
          <a class="custom-icon icon has-text-info" href="https://www.instagram.com/daeda.kz/">
            <fa-icon :icon="['fab', 'instagram']"></fa-icon>
          </a>
        </div>
      </div>
      <div class="info-section-body">
        🚀 Представляем вам нашу новую услугу доставки обедов прямо в ваш офис! 🥗🍲 <br/>
        🌟 Забудьте о бессмысленных поисках ланча и долгих очередях! Теперь у вас есть возможность наслаждаться вкусным, сбалансированным и свежим обедом, прямо на рабочем месте! 🌟 <br/>
        
        Что вы получаете, выбирая нас? 🎁 <br/>
        🥗 <strong>Разнообразное меню:</strong> Мы предлагаем широкий выбор блюд, от классических до экзотических. Все наши обеды готовятся из свежих и качественных ингредиентов, чтобы удовлетворить самый изысканный вкус. <br/>
        🚀 <strong>Удобство и комфорт:</strong> Заказывайте обеды прямо с вашего рабочего места, используя наше удобное мобильное приложение или сайт. Мы доставим ваш заказ точно в указанное время, чтобы вы могли насладиться вкусным обедом без прерывания рабочего процесса. <br/>
        🌍 <strong>Здоровое питание:</strong> Наша команда поваров следит за балансом питательных веществ в каждом блюде. Мы предлагаем различные варианты, учитывая диетические предпочтения, аллергии и особые потребности. <br/>
        💼 <strong>Корпоративные заказы:</strong> Если у вас есть встреча или мероприятие в офисе, мы готовы обеспечить доставку большого количества обедов для всей команды. Вы можете быть уверены, что каждый член вашей команды получит свежий и вкусный обед. <br/>
        
        📱 Подписывайтесь на нашу страницу <a class="has-text-info" href="https://www.instagram.com/daeda.kz/">Instagram</a> и не пропустите ни одного обновления! Мы регулярно предлагаем акции, скидки и специальные предложения, чтобы сделать ваш обед еще более приятным. <br/>
        📞 Заказывайте прямо сейчас и наслаждайтесь вкусом удобства! Нажмите на ссылку в профиле, чтобы узнать больше и сделать свой первый заказ. <br/>
        🥗🚀 Порадуйте свой вкус и упростите свою жизнь с нашей услугой доставки обедов в офис! 🥗🚀
      </div>
      <button class="button is-info" @click="() => $router.push('/menu')">Посмотреть меню на завтра</button>
      <h1 class="title">Преимущества Компании</h1>
      <div class="columns is-multiline is-mobile">
        <div class="column is-half">
          1. В отличие от других компаний, мы предлагаем широкий выбор от 6 до 10 видов горячих блюд каждый день. У нас есть разнообразие блюд, чтобы удовлетворить любой вкус и пожелания наших клиентов.
        </div>
        <div class="column is-half">
          2. Представьте себе: каждый день у вас есть возможность выбрать из множества блюд, чтобы составить свой идеальный обед. Будь то свежие салаты, сытные супы, сочные мясные блюда или аппетитные вегетарианские варианты - мы имеем все, что вам нужно!
        </div>
        <div class="column is-half">
          3. Наши шеф-повары тщательно готовят каждое блюдо с использованием только лучших ингредиентов. Мы ценим качество и вкус, чтобы каждый обед, который вы заказываете у нас, был незабываемым и удовлетворял самым высоким стандартам.
        </div>
        <div class="column is-half">
          4. Мы гордимся своим разнообразием, поэтому наше меню постоянно обновляется. Мы внимательно слушаем пожелания наших клиентов и добавляем новые варианты блюд, чтобы удовлетворить самые разнообразные предпочтения.
        </div>
        <div class="column is-half">
          5. Не теряйте времени на монотонные обеды. Закажите у нас и насладитесь разнообразием, которое вы заслуживаете. Мы гарантируем вам удовольствие от каждого кушанья.
        </div>
        <div class="column is-half">
          Закажите прямо сейчас и окунитесь в мир вкусов нашего разнообразного меню!
        </div>
      </div>
    </section>
    <div class="sticky-icons">
      <a class="custom-icon icon has-text-info" href="tel:+7(727)220-6315">
        <fa-icon :icon="['fas', 'phone']"></fa-icon>
      </a>
      <a class="custom-icon icon has-text-info" href="https://wa.me/77085293662?text=Здравствуйте,%20интересует%20доставка%20обедов%20в%20офис!">
        <fa-icon :icon="['fab', 'whatsapp']"></fa-icon>
      </a>
      <a class="custom-icon icon has-text-info" href="https://www.instagram.com/daeda.kz/">
        <fa-icon :icon="['fab', 'instagram']"></fa-icon>
      </a>
    </div>
  </div>
</template>

<script>
</script>

<style scoped>
  .call-button {
    display: flex;
    align-items: center;
  }
  .info-section {
    display: flex;
    flex-direction: column;
    align-items: center;
    margin: auto;
    max-width: 1000px;
  }
  .custom-icon {
    font-size: x-large;
    margin: 5px;
  }
  .sticky-icons {
    position: sticky;
    bottom: 20px;
    right:10px;
    margin-left:auto;
    width: 70px;
    display: flex;
    flex-direction: column;
  }
</style>